---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthAll
source: html/56377169-589c-d5aa-af98-792c5ed691dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesForWidthAll Property

Division family cannot be used for all widths of hosts

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesProfilesForWidthAll { get; }
```